; domain
(define (domain robotwaiter)
  (:requirements :strips :typing :negative-preconditions)

    (:types dish location table)

    (:predicates
    (robot-at ?a - location)                           ; robot is at location ?a
    (adjacent ?a1 - location ?a2 - location)           ; locations ?a1 and ?a2 are adjacent
    (dish-at ?d - dish ?a - location)                  ; dish ?d is at location ?a
    (carrying ?d - dish)                               ; robot is carrying dish ?d
    (free-hands)                                       ; robot's hands are free
    (table-at ?t - table ?a - location)                ; table ?t is at location ?a
    (order-at ?d - dish ?t - table)                    ; dish ?d is ordered at table ?t
    (served ?t - table)                                ; table ?t has been served
    )

  ; MOVE: robot walks from one area to an adjacent area.
  (:action move
    :parameters (?from - location ?to - location)
    :precondition (and
      (robot-at ?from)                          ; robot at area
      (adjacent ?from ?to)                      ; destination its adjacent to "from"
    )
    :effect (and
      (NOT (robot-at ?from))                    ; from has no robot
      (robot-at ?to)                            ; robot at destination
    )
  )

  (:action pick-up
      :parameters (?d - dish ?a - location)
      :precondition (and 
                    (robot-at ?a)
                    (dish-at ?d ?a)
                    (free-hands)
                    )
      :effect (and 
              (carrying ?d)
              (NOT (free-hands))
              (NOT (dish-at ?d ?a))
              )
  )

  (:action present-dish
      :parameters (?d - dish ?a - location ?t - table)
      :precondition (and 
                    (robot-at ?a)
                    (carrying ?d)
                    (table-at ?t ?a)
                    (order-at ?d ?t)
                    (NOT (served ?t))
                    )
      :effect (and 
              (served ?t)
              (NOT (carrying ?d))
              (free-hands)
              )
    )
)

; problem
(define (problem restaurant-delivery-simple)
  (:domain robotwaiter)
  
  (:objects
    kitchen hall dr1 dr2 dr3 dr4 dr5 dr6 dr7 dr8 - location
    dish1 - dish
    table1 table2 table3 table4 table5 table6 table7 table8 - table
  )
  
  (:init
    ; Adjacencies
    (adjacent kitchen dr6)

    (adjacent dr6 kitchen)
    (adjacent dr6 dr7)
    
    (adjacent dr7 dr6)
    (adjacent dr7 dr8)
    
    (adjacent dr8 dr7)
    (adjacent dr8 dr5)
    
    (adjacent dr5 dr8)
    (adjacent dr5 dr4)
    
    (adjacent dr4 dr5)
    (adjacent dr4 dr3)
    
    (adjacent dr3 dr4)
    (adjacent dr3 dr1)
    
    (adjacent dr1 dr3)
    (adjacent dr1 dr2)
    
    (adjacent dr2 dr1)
    (adjacent dr2 hall)
    
    (adjacent hall dr2)
    
    ; Initial state
    (robot-at hall)
    (dish-at dish1 kitchen)
    (free-hands)
    
    ; All tables locations
    (table-at table1 dr2)
    (table-at table2 dr1)
    (table-at table3 dr3)
    (table-at table4 dr4)
    (table-at table5 dr5)
    (table-at table6 dr8)
    (table-at table7 dr7)
    (table-at table8 dr6)
    
    ; Orders
    (order-at dish1 table1)
  )
  
  (:goal (and
    (served table1)
    (robot-at kitchen)
  ))
)

; plan
1. (move hall dr2)
   deleted: (robot-at hall)
   added: (robot-at dr2)
   goals met: 0 of 2
2. (move dr2 dr1)
   deleted: (robot-at dr2)
   added: (robot-at dr1)
   goals met: 0 of 2
3. (move dr1 dr3)
   deleted: (robot-at dr1)
   added: (robot-at dr3)
   goals met: 0 of 2
4. (move dr3 dr4)
   deleted: (robot-at dr3)
   added: (robot-at dr4)
   goals met: 0 of 2
5. (move dr4 dr5)
   deleted: (robot-at dr4)
   added: (robot-at dr5)
   goals met: 0 of 2
6. (move dr5 dr8)
   deleted: (robot-at dr5)
   added: (robot-at dr8)
   goals met: 0 of 2
7. (move dr8 dr7)
   deleted: (robot-at dr8)
   added: (robot-at dr7)
   goals met: 0 of 2
8. (move dr7 dr6)
   deleted: (robot-at dr7)
   added: (robot-at dr6)
   goals met: 0 of 2
9. (move dr6 kitchen)
   deleted: (robot-at dr6)
   added: (robot-at kitchen)
   goals met: 1 of 2
10. (pick-up dish1 kitchen)
   deleted: (free-hands) (dish-at dish1 kitchen)
   added: (carrying dish1)
   goals met: 1 of 2
11. (move kitchen dr6)
   deleted: (robot-at kitchen)
   added: (robot-at dr6)
   goals met: 0 of 2
12. (move dr6 dr7)
   deleted: (robot-at dr6)
   added: (robot-at dr7)
   goals met: 0 of 2
13. (move dr7 dr8)
   deleted: (robot-at dr7)
   added: (robot-at dr8)
   goals met: 0 of 2
14. (move dr8 dr5)
   deleted: (robot-at dr8)
   added: (robot-at dr5)
   goals met: 0 of 2
15. (move dr5 dr4)
   deleted: (robot-at dr5)
   added: (robot-at dr4)
   goals met: 0 of 2
16. (move dr4 dr3)
   deleted: (robot-at dr4)
   added: (robot-at dr3)
   goals met: 0 of 2
17. (move dr3 dr1)
   deleted: (robot-at dr3)
   added: (robot-at dr1)
   goals met: 0 of 2
18. (move dr1 dr2)
   deleted: (robot-at dr1)
   added: (robot-at dr2)
   goals met: 0 of 2
19. (present-dish dish1 dr2 table1)
   deleted: (carrying dish1)
   added: (served table1) (free-hands)
   goals met: 1 of 2
20. (move dr2 dr1)
   deleted: (robot-at dr2)
   added: (robot-at dr1)
   goals met: 1 of 2
21. (move dr1 dr3)
   deleted: (robot-at dr1)
   added: (robot-at dr3)
   goals met: 1 of 2
22. (move dr3 dr4)
   deleted: (robot-at dr3)
   added: (robot-at dr4)
   goals met: 1 of 2
23. (move dr4 dr5)
   deleted: (robot-at dr4)
   added: (robot-at dr5)
   goals met: 1 of 2
24. (move dr5 dr8)
   deleted: (robot-at dr5)
   added: (robot-at dr8)
   goals met: 1 of 2
25. (move dr8 dr7)
   deleted: (robot-at dr8)
   added: (robot-at dr7)
   goals met: 1 of 2
26. (move dr7 dr6)
   deleted: (robot-at dr7)
   added: (robot-at dr6)
   goals met: 1 of 2
27. (move dr6 kitchen)
   deleted: (robot-at dr6)
   added: (robot-at kitchen)
   goals met: 2 of 2
